Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: །དེ་ནས་ཚེ་དང་ལྡན་པ་བྱམས་གང་གི་བུས། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་གནས་བརྟན་རབ་འབྱོར་འདི་བྱང་ཆུབ་སེམས་དཔའ་གཅིག་ཏུ་ཡང་འདོད་དམ། གནས་བརྟན་རབ་འབྱོར་འདི་ལ་དྲི་དགོས་སོ།
en: Then the venerable Pūrṇa Maitrāyaṇīputra said to the venerable Śāradvatīputra, “Venerable Śāradvatīputra, you should ask this elder Subhūti whether he holds that there is even a single bodhisattva!”

source: །དེ་ནས་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུས། ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཚེ་དང་ལྡན་པ་རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སངས་རྒྱས་ཀྱི་ཐེག་པ་པ་འདོད་དམ།
en: Then the venerable Śāradvatīputra asked the venerable Subhūti, “Venerable Subhūti, do you hold that bodhisattvas are followers [solely] of the vehicle of the buddhas?” {

source: ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་དེ་བཞིན་ཉིད་ལ་བྱང་ཆུབ་སེམས་དཔའ་ཉན་ཐོས་ཀྱི་ཐེག་པ་པ་དང་། རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་པ་དང་། སངས་རྒྱས་ཀྱི་ཐེག་པ་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་གསུམ་དུ་འདོད་དམ།
en: IV: 134} Subhūti asked in return, “Venerable Śāradvatīputra, do you hold that according to the real nature there are three sorts of bodhisattvas—those who follow the vehicle of the śrāvakas, those who follow the vehicle of the pratyekabuddhas, and those who follow the vehicle of the buddhas?” “

source: སྨྲས་པ། ཚེ་དང་ལྡན་པ་རབ་འབྱོར་དེ་ནི་མ་ཡིན་ནོ།
en: No, Venerable Subhūti!” “

source: །སྨྲས་པ་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་དེ་བཞིན་ཉིད་ལ་བྱང་ཆུབ་སེམས་དཔའ་གསུམ་དུ་དམིགས་སམ་སྨྲས་པ་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་དེ་ནི་མ་ཡིན་ནོ།
en: Venerable Śāradvatīputra, according to the real nature, can three sorts of bodhisattvas then be apprehended? “No, Venerable Subhūti!” “

source: །སྨྲས་པ་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་རྒྱུ་གཅིག་གམ། རྒྱུ་གཉིས་སམ། རྒྱུ་གསུམ་གྱིས་དེ་བཞིན་ཉིད་དམིགས་སམ།
en: Venerable Śāradvatīputra, can the real nature be apprehended through one mode, two modes, or three modes?” “

source: །སྨྲས་པ་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་དེ་བཞིན་ཉིད་ལ་བྱང་ཆུབ་སེམས་དཔའ་གཅིག་ཀྱང་ཡང་དག་པར་རྗེས་སུ་མཐོང་ངམ།
en: Venerable Śāradvatīputra, according to the real nature, can one observe even a single bodhisattva?” “

source: །དེ་ལྟར་བདེན་པའི་ཚུལ་བཞིན་དུ་ཆོས་དེ་དག་མི་དམིགས་ན། ཅི་ལས་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་འདི་སྙམ་དུ་བྱང་ཆུབ་སེམས་དཔའ་འདི་ནི་ཉན་ཐོས་ཀྱི་ཐེག་པ་པའོ། །བྱང་ཆུབ་སེམས་དཔའ་འདི་ནི་རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་པའོ། བྱང་ཆུབ་སེམས་དཔའ་འདི་ནི་སངས་རྒྱས་ཀྱི་ཐེག་པ་པའོ། །ཞེས་བྱ་བར་སེམས་པར་གྱུར།
en: So, if one cannot apprehend those phenomena as being truly established, where, Venerable Śāradvatīputra, do you get the idea that this bodhisattva follows the vehicle of the śrāvakas, this bodhisattva follows the vehicle of the pratyekabuddhas, and this bodhisattva follows the vehicle of the buddhas?

source: ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཐམས་ཅད་ཀྱི་དེ་བཞིན་ཉིད་ཀྱིས་བྱེ་བྲག་མེད་པར་རབ་ཏུ་ཕྱེ་བ་ལ།
en: It is in this manner, Venerable Śāradvatīputra, that bodhisattva great beings should analyze phenomena in accordance with the real nature and without distinctions.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སེམས་མི་འཇུམ་ཞིང་། འགོང་བ་མེད་ལ། ཡིད་ལ་འགྱོད་པ་མེད་ན། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ནི། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་འབྱུང་བར་འགྱུར་རོ།
en: If bodhisattva great beings are not discouraged, disheartened, or regretful, those bodhisattva great beings will be emancipated in unsurpassed, complete enlightenment.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ལ་བཀའ་སྩལ་པ། རབ་འབྱོར་ལེགས་སོ་ལེགས་སོ།
en: Then the Blessed One said to the venerable Subhūti, “Excellent, Subhūti!

source: །འདི་ལྟར་སངས་རྒྱས་ཀྱི་མཐུས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་ཕྱིར་ཁྱོད་ཀྱི་ཚིག་བརྗོད་པ་ལེགས་པར་སྦོབས་སོ།
en: Excellent! By the power of the buddhas your words are inspired for the sake of bodhisattva great beings!

source: །རབ་འབྱོར་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཐམས་ཅད་ཀྱི་དེ་བཞིན་ཉིད་ཀྱི་བྱེ་བྲག་མེད་པར་རབ་ཏུ་ཕྱེ་བ་ལ།
en: Subhūti, it is in this manner that bodhisattva great beings should analyze phenomena according to the real nature and without distinctions.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་སེམས་མི་འཇུམ་ཞིང་འགོང་བ་མེད་ལ། ཡིད་ལ་འགྱོད་པ་མེད་ཅིང་། མི་འཇིགས་མི་སྡང་སྐྲག་པར་མི་འགྱུར་ན། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་འབྱུང་བར་འགྱུར་རོ།
en: If bodhisattva great beings are not discouraged, disheartened, or regretful, and if they are not afraid and terrified, those bodhisattva great beings will be emancipated in unsurpassed, complete enlightenment.”

source: །རབ་འབྱོར་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་དེ་ལྟ་བུའི་ཆོས་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱང་ཆུབ་གང་གིས་འབྱུང་བར་འགྱུར།
en: Subhūti then asked, “Blessed Lord, through which enlightenment will bodhisattva great beings who possess such attributes be emancipated?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱིས། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་འབྱུང་བར་འགྱུར་རོ།
en: Subhūti,” replied the Blessed One, “those bodhisattva great beings will be emancipated through unsurpassed, complete enlightenment.” {

source: བཅོམ་ལྡན་འདས་འབྱུང་བར་འཚལ་བའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལ་ཇི་ལྟར་གནས་པར་བགྱི།
en: IV: 135} Subhūti then asked, “Blessed Lord, how should bodhisattva great beings who seek emancipation in unsurpassed, complete enlightenment dwell?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། སེམས་ཅན་ཐམས་ཅད་ལ་སེམས་མཉམ་པ་ཉིད་དུ་གནས་པར་བྱའོ།
en: The Blessed One replied, “Their minds should dwell in a state of equanimity with respect to all beings.

source: །སེམས་ཅན་ཐམས་ཅད་ལ་མཉམ་པའི་སེམས་བསྐྱེད་པར་བྱ་སྟེ། མི་མཉམ་པའི་སེམས་བསྐྱེད་པར་མི་བྱའོ།
en: They should develop even-mindedness with respect to all beings, and they should not develop a state of mind that is imbalanced.

source: །སེམས་ཅན་ཐམས་ཅད་ལ་མཉམ་པའི་སེམས་ཀྱིས་དམིགས་པར་བྱ་སྟེ། མི་མཉམ་པའི་སེམས་ཀྱིས་དམིགས་པར་མི་བྱའོ།
en: They should apprehend all beings with even-mindedness, and not apprehend them with a mind that is imbalanced.

source: །སེམས་ཅན་ཐམས་ཅད་ལ་བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་བསྐྱེད་པར་བྱའོ། །སེམས་ཅན་ཐམས་ཅད་ལ་བྱམས་པའི་སེམས་ཀྱིས་དམིགས་པར་བྱ་སྟེ།
en: They should develop great loving kindness and great compassion for all beings.

source: བརླང་བའི་སེམས་ཀྱིས་དམིགས་པར་མི་བྱའོ།
en: They should not apprehend them with a mind that is coarse.

source: །སེམས་ཅན་ཐམས་ཅད་ལ་ང་རྒྱལ་མེད་པར་བྱའོ། །སེམས་ཅན་ཐམས་ཅད་ལ། གཡོ་མེད་པར་བྱའོ།
en: They should be without arrogance with respect to all beings and be without deceit with respect to all beings.

source: །སེམས་ཅན་ཐམས་ཅད་ལ་ཕན་པའི་སེམས་བསྐྱེད་པར་བྱ་སྟེ། གནོད་པའི་སེམས་བསྐྱེད་པར་མི་བྱའོ།
en: They should develop an attitude of benefit toward all beings, and they should not develop an attitude that is harmful to them.

source: །སེམས་ཅན་ཐམས་ཅད་ལ་ཕན་པའི་སེམས་ཀྱིས་དམིགས་པར་བྱ་སྟེ། གནོད་པའི་སེམས་ཀྱིས་དམིགས་པར་མི་བྱའོ།
en: They should apprehend all beings with an attitude that is beneficial, and they should not apprehend them with an attitude that is harmful.

source: །སེམས་ཅན་ཐམས་ཅད་ལ་ཁོང་ཁྲོ་བ་མེད་པའི་སེམས་བསྐྱེད་པར་བྱ་སྟེ། ཁོང་ཁྲོ་བའི་སེམས་མི་བསྐྱེད་དོ།
en: They should develop an attitude that is free from enmity for all beings, and they should not develop an attitude of enmity.

source: །སེམས་ཅན་ཐམས་ཅད་ལ་མི་འཚེ་བའི་སེམས་བསྐྱེད་པར་བྱ་སྟེ། འཚེ་བའི་སེམས་མི་བསྐྱེད་དོ།
en: They should develop an attitude toward all beings that is free from harming, and they should not develop an attitude that harms them.

source: །སེམས་ཅན་ཐམས་ཅད་ལ་མི་འཚེ་བའི་སེམས་ཀྱིས་དམིགས་པར་བྱ་སྟེ། འཚེ་བའི་སེམས་ཀྱིས་དམིགས་པར་མི་བྱའོ།
en: They should apprehend all beings with an attitude that is free from harm, and they should not apprehend them with a harmful attitude.

source: །སེམས་ཅན་ཐམས་ཅད་ལ་མའི་སེམས་དང་། ཕའི་སེམས་དང་། ཕུ་ནུའི་སེམས་དང་། སྲིང་མོའི་སེམས་དང་། གྲོགས་པོ་དང་།
en: They should develop an attitude that regards all beings as their mother, with an attitude that regards them as their father, with an attitude that regards them as their brother, with an attitude that regards them as their sister, and with an attitude that regards them as their allies and kinsmen.

source: གཉེན་པ་དང་རུས་གཅིག་པའི་སེམས་བསྐྱེད་པར་བྱའོ། །སེམས་ཅན་ཐམས་ཅད་ལ་མ་དང་ཕའི་སེམས་དང་། ཕུ་ནུ་དང་སྲིང་མོའི་སེམས་དང་། གྲོགས་པོ་དང་གཉེན་པ་དང་། རུས་གཅིག་པའི་སེམས་ཀྱིས་དམིགས་པར་བྱའོ།
en: They should offer benedictions and greetings with an attitude that regards all beings as their parents, brothers, sisters, friends, allies, and kinsmen.

source: །བདག་གིས་ཀྱང་སྲོག་གཅོད་པ་སྤང་བར་བྱ། གཞན་ཡང་སྲོག་གཅོད་པ་སྤང་བ་ལ་ཡང་དག་པར་བསྐུལ་བར་བྱ།
en: They themselves should also abstain from killing living creatures, and they should encourage others to abstain from killing living creatures.

source: སྲོག་གཅོད་པ་སྤངས་པའི་ལེགས་པ་བརྗོད་པར་བྱ།
en: They should praise abstention from the killing of living creatures.

source: གཞན་གང་གིས་སྲོག་གཅོད་པ་སྤངས་པ་དེ་དག་གི་ལེགས་པ་བརྗོད་ཅིང་འཐུན་པས་དགའ་བར་བྱའོ།
en: They should praise and take empathetic delight in others abstaining from the killing of living creatures. {Ki.

source: །བདག་གིས་ཀྱང་མ་བྱིན་པར་ལེན་པ་སྤང་བར་བྱ། གཞན་ཡང་མ་བྱིན་པར་ལེན་པ་སྤང་བ་ལ་ཡང་དག་པར་བསྐུལ་བར་བྱ།
en: IV: 136} They themselves should abstain from stealing, and they should encourage others to abstain from stealing.

source: མ་བྱིན་པར་ལེན་པ་སྤང་བའི་ལེགས་པ་བརྗོད་པར་བྱ།
en: They should praise abstention from stealing.

source: གཞན་གང་གིས་མ་བྱིན་པར་ལེན་པ་སྤངས་པ་དེ་དག་གི་ལེགས་པ་བརྗོད་ཅིང་འཐུན་པས་དགའ་བར་བྱའོ།
en: They should praise and take empathetic delight in others abstaining from stealing.

source: །བདག་གིས་ཀྱང་འདོད་པས་ལོག་པར་གཡེམ་པ་སྤང་བར་བྱ། གཞན་ཡང་འདོད་པས་ལོག་པར་གཡེམ་པ་སྤང་བ་ལ་ཡང་དག་པར་བསྐུལ་བར་བྱ།
en: They themselves should abstain from sexual misconduct, and they should encourage others to abstain from sexual misconduct.

source: འདོད་པས་ལོག་པར་གཡེམ་པ་སྤང་བའི་ལེགས་པ་བརྗོད་པར་བྱ།
en: They should praise abstention from sexual misconduct.

source: གཞན་གང་གིས་འདོད་པས་ལོག་པར་གཡེམ་པ་སྤངས་པ་དེ་དག་གིས་ལེགས་པ་བརྗོད་ཅིང་། འཐུན་པས་དགའ་བར་བྱའོ།
en: They should praise and take empathetic delight in others abstaining from sexual misconduct.

source: །བདག་གིས་ཀྱང་བརྫུན་དུ་སྨྲ་བ་དང་། ཕྲ་མ་དང་། ཞེ་གཅོད་པ་དང་། ཚིག་ཀྱལ་བ་དང་། ཆགས་སེམས་དང་གནོད་སེམས་དང་།
en: They themselves should abstain from telling lies, slander, harsh words, nonsensical chatter, covetousness, malice, and wrong views, and they should encourage others to abstain from wrong views [and so forth].

source: ལོག་པར་ལྟ་བ་སྤང་བར་བྱ།
en: They should praise abstention from wrong views [and so forth].

source: གཞན་ཡང་ལོག་པར་ལྟ་བ་སྤང་བ་ལ་ཡང་དག་པར་བསྐུལ་བར་བྱ། ལོག་པར་ལྟ་བ་སྤོང་བའི་ལེགས་པ་བརྗོད་པར་བྱ། གཞན་གང་གིས་ལོག་པར་ལྟ་བ་སྤངས་པ་དེ་དག་གི་ལེགས་པ་བརྗོད་ཅིང་འཐུན་པས་དགའ་བར་བྱ་སྟེ།
en: They should praise and take empathetic delight in others abstaining from wrong views [and so forth].

source: དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འདོད་པས་མི་དམིགས་པའི་ཚུལ་གྱིས་གནས་པར་བྱའོ།
en: It is in this way that bodhisattva great beings who wish to attain consummate buddhahood in unsurpassed, complete enlightenment should dwell without apprehending anything. “

source: །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་བདག་གིས་ཀྱང་བསམ་གཏན་དང་པོ་ལ་མཉམ་པར་གཞག་པར་བྱ། གཞན་ཡང་བསམ་གཏན་དང་པོ་ལ་ཡང་དག་པར་བསྐུལ་བར་བྱ།
en: Moreover, Subhūti, bodhisattva great beings should themselves be absorbed in the first meditative concentration, and they should encourage others to acquire the first meditative concentration.

source: བསམ་གཏན་དང་པོ་ལ་སྙོམས་པར་འཇུག་པའི་ལེགས་པ་བརྗོད་པར་བྱ།
en: They should praise absorption in the first meditative concentration.

source: གཞན་གང་བསམ་གཏན་དང་པོ་ལ་སྙོམས་པར་འཇུག་པ་དེ་དག་གི་ལེགས་པར་བརྗོད་ཅིང་འཐུན་པས་དགའ་བར་བྱའོ།
en: They should praise and take empathetic delight in others being absorbed in the first meditative concentration.

source: །བདག་གིས་ཀྱང་བསམ་གཏན་གཉིས་པ་དང་། བསམ་གཏན་གསུམ་པ་དང་། བསམ་གཏན་བཞི་པ་ལ་སྙོམས་པར་འཇུག་པར་བྱ། གཞན་ཡང་བསམ་གཏན་བཞི་པ་ལ་ཡང་དག་པར་བསྐུལ་བར་བྱ།
en: They should themselves be absorbed in the second meditative concentration, the third meditative concentration, and the fourth meditative concentration, and they should encourage others to acquire the fourth meditative concentration [and so forth].

source: བསམ་གཏན་བཞི་པ་ལ་སྙོམས་པར་འཇུག་པའི་ལེགས་པ་བརྗོད་པར་བྱ།
en: They should praise absorption in the fourth meditative concentration [and so forth].

source: གཞན་གང་བསམ་གཏན་བཞི་པ་ལ་སྙོམས་པར་འཇུག་པ་དེ་དག་གི་ལེགས་པར་བརྗོད་ཅིང་འཐུན་པས་དགའ་བར་བྱ་སྟེ།
en: They should praise and take empathetic delight in others being absorbed in the fourth meditative concentration [and so forth].

source: དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འདོད་པས། དེ་མི་དམིགས་པའི་ཚུལ་གྱིས་གནས་པར་བྱའོ།
en: It is in this way that bodhisattva great beings who wish to attain consummate buddhahood in unsurpassed, complete enlightenment should dwell without apprehending anything. “

source: །བདག་གིས་ཀྱང་བྱམས་པ་ལ་མཉམ་པར་གཞག་པར་བྱ། གཞན་ཡང་བྱམས་པ་ལ་ཡང་དག་པར་བསྐུལ་བར་བྱ།
en: They themselves should be absorbed in loving kindness, and they should encourage others to acquire loving kindness.

source: བྱམས་པའི་ལེགས་པ་བརྗོད་པར་བྱ།
en: They should praise loving kindness.

source: གཞན་གང་བྱམས་པ་ལ་སྙོམས་པར་འཇུག་པ་དེ་དག་གི་ལེགས་པ་བརྗོད་ཅིང་འཐུན་པས་དགའ་བར་བྱའོ།
en: They should praise and take empathetic delight in others being absorbed in loving kindness.

source: །བདག་གིས་ཀྱང་སྙིང་རྗེ་དང་། དགའ་བ་དང་། བཏང་སྙོམས་ལ་མཉམ་པར་གཞག་པར་བྱ། གཞན་ཡང་བཏང་སྙོམས་ལ་ཡང་དག་པར་བསྐུལ་བར་བྱ།
en: They themselves should be absorbed in compassion, empathetic joy, and equanimity, and they should encourage others to acquire equanimity [and so forth].

source: བཏང་སྙོམས་ཀྱི་ལེགས་པ་བརྗོད་པར་བྱ།
en: They should praise equanimity [and so forth].

source: གཞན་གང་བཏང་སྙོམས་ལ་སྙོམས་པར་འཇུག་པ་དེ་དག་གི་ལེགས་པ་བརྗོད་ཅིང་འཐུན་པས་དགའ་བར་བྱའོ།
en: They should praise and take empathetic delight in others being absorbed in equanimity [and so forth]. {Ki.

source: །བདག་གིས་ཀྱང་གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་ལ་མཉམ་པར་གཞག་པར་བྱ། གཞན་ཡང་གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་ལ་ཡང་དག་པར་བསྐུལ་བར་བྱ།
en: IV: 137} They themselves should be absorbed in the formless absorptions, and they should encourage others to acquire the formless absorptions.

source: གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པའི་ལེགས་པ་བརྗོད་པར་བྱ།
en: They should praise the formless absorptions.

source: གཞན་གང་གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དེ་དག་གི་ལེགས་པ་བརྗོད་ཅིང་འཐུན་པས་དགའ་བར་བྱའོ།
en: They should praise and take empathetic delight in others who acquire the formless absorptions. “

source: །བདག་གིས་ཀྱང་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་བྱ། གཞན་ཡང་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་ཡང་དག་པར་བསྐུལ་བར་བྱ།
en: They themselves should perfect the perfection of generosity, and they should encourage others also to acquire the perfection of generosity.

source: སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པའི་ལེགས་པ་བརྗོད་པར་བྱ།
en: They should praise the perfection of generosity.

source: སེམས་ཅན་གཞན་གང་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་བྱེད་པ་དེ་དག་གི་ལེགས་པ་བརྗོད་ཅིང་འཐུན་པས་དགའ་བར་བྱའོ། །བདག་གིས་ཀྱང་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་།
en: They should also praise and take empathetic delight in other beings perfecting the perfection of generosity.

source: བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་བྱ། གཞན་ཡང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་ཡང་དག་པར་བསྐུལ་བར་བྱ།
en: They themselves should perfect the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom, and they should encourage others also to acquire the perfection of wisdom [and so forth].

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་ལེགས་པ་བརྗོད་པར་བྱ།
en: They should praise the perfection of wisdom [and so forth].

source: སེམས་ཅན་གཞན་གང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་བྱེད་པ་དེ་དག་གི་ལེགས་པ་བརྗོད་ཅིང་འཐུན་བས་དགའ་བར་བྱ་སྟེ།
en: They should also praise and take empathetic delight in other beings perfecting the perfection of wisdom [and so forth].

source: །བདག་གིས་ཀྱང་ནང་སྟོང་པ་ཉིད་ལ་མཉམ་པར་གཞག་པར་བྱ། གཞན་ཡང་ནང་སྟོང་པ་ཉིད་ལ་ཡང་དག་པར་བསྐུལ་བར་བྱ།
en: They themselves should be absorbed in the emptiness of internal phenomena, and they should also encourage others to acquire the emptiness of internal phenomena.

source: ནང་སྟོང་པ་ཉིད་ཀྱི་ལེགས་པ་བརྗོད་པར་བྱ།
en: They should praise the emptiness of internal phenomena.

source: སེམས་ཅན་གཞན་གང་ནང་སྟོང་པ་ཉིད་ལ་སྙོམས་པར་འཇུག་པ་དེ་དག་གི་ལེགས་པ་བརྗོད་ཅིང་འཐུན་པས་དགའ་བར་བྱའོ།
en: They should also praise and take empathetic delight in other beings being absorbed in the emptiness of internal phenomena.

source: །བདག་གིས་ཀྱང་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་ལ་མཉམ་པར་གཞག་པར་བྱ། གཞན་ཡང་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་ལ་ཡང་དག་པར་བསྐུལ་བར་བྱ།
en: They themselves should be absorbed in [all the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, and they should also encourage others to acquire the emptiness of the essential nature of nonentities [and so forth].

source: དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་ལེགས་པ་བརྗོད་པར་བྱ།
en: They should praise the emptiness of the essential nature of nonentities [and so forth].

source: སེམས་ཅན་གཞན་གང་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ལ་སྙོམས་པར་འཇུག་པ་དེ་དག་གི་ལེགས་པ་བརྗོད་ཅིང་འཐུན་པས་དགའ་བར་བྱའོ།
en: They should also praise and take empathetic delight in other beings being absorbed in the emptiness of the essential nature of nonentities [and so forth]. “

source: །བདག་གིས་ཀྱང་དྲན་པ་ཉེ་བར་གཞག་པ་བཞི་བསྒོམ་པར་བྱ། གཞན་ཡང་དྲན་པ་ཉེ་བར་གཞག་པ་བཞི་ལ་ཡང་དག་པར་བསྐུལ་བར་བྱ།
en: They themselves should cultivate the four applications of mindfulness, and they should also encourage others to acquire the four applications of mindfulness.

source: དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་ཀྱི་ལེགས་པ་བརྗོད་པར་བྱ།
en: They should praise the applications of mindfulness.

source: སེམས་ཅན་གཞན་གང་དྲན་པ་ཉེ་བར་གཞག་པ་བཞི་བསྒོམ་པ་དེ་དག་གི་ལེགས་པ་བརྗོད་ཅིང་འཐུན་པས་དགའ་བར་བྱའོ། །བདག་གིས་ཀྱང་ཡང་དག་པར་སྤོང་པ་དང་།
en: They should praise and take empathetic delight in other beings cultivating the four applications of mindfulness.

source: རྫུ་འཕྲུལ་གྱི་རྐང་པ་དང་དབང་པོ་དང་སྟོབས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་བསྒོམ་པར་བྱ། གཞན་ཡང་འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་ལ་ཡང་དག་པར་བསྐུལ་བར་བྱ།
en: They themselves should cultivate the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, and the noble eightfold path, and they should also encourage others to acquire the noble eightfold path [and so forth].

source: འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པའི་ལེགས་པ་བརྗོད་པར་བྱ།
en: They should praise the noble eightfold path [and so forth].

source: སེམས་ཅན་གཞན་གང་འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་བསྒོམ་པ་དེ་དག་གི་ལེགས་པ་བརྗོད་ཅིང་འཐུན་པས་དགའ་བར་བྱའོ།
en: They should praise and take empathetic delight in other beings cultivating the noble eightfold path [and so forth]. {Ki.

source: །བདག་གིས་ཀྱང་འཕགས་པའི་བདེན་པ་དང་བསམ་གཏན་དང་ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་བསྒོམ་པར་བྱ། གཞན་ཡང་མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་ལ་ཡང་དག་པར་བསྐུལ་བར་བྱ།
en: IV: 138} “They themselves should cultivate the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the eight aspects of liberation, and the nine serial steps of meditative absorption, and they should also encourage others to acquire the nine serial steps of meditative absorption [and so forth].

source: མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུའི་ལེགས་པ་བརྗོད་པར་བྱ།
en: They should praise the nine serial steps of meditative absorption [and so forth].

source: སེམས་ཅན་གཞན་གང་མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་བསྒོམ་པ་དེ་དག་གི་ལེགས་པ་བརྗོད་ཅིང་འཐུན་པས་དགའ་བར་བྱའོ།
en: They should praise and take empathetic delight in other beings cultivating nine serial steps of meditative absorption [and so forth]. “

source: བདག་གིས་ཀྱང་སྟོང་པ་ཉིད་དང་མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་བསྒོམ་པར་བྱ། གཞན་ཡང་སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་ལ་ཡང་དག་པར་བསྐུལ་བར་བྱ།
en: They themselves should cultivate emptiness, signlessness, and wishlessness, and they should also encourage others to acquire emptiness, signlessness, and wishlessness.

source: སྟོང་པ་ཉིད་དང་མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པའི་ལེགས་པ་བརྗོད་པར་བྱ།
en: They should praise emptiness, signlessness, and wishlessness.

source: སེམས་ཅན་གཞན་གང་སྟོང་པ་ཉིད་དང་མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་བསྒོམ་པ་དེ་དག་གི་ལེགས་པ་བརྗོད་ཅིང་འཐུན་པས་དགའ་བར་བྱའོ།
en: They should praise and take empathetic delight in other beings cultivating emptiness, signlessness, and wishlessness.

source: །བདག་གིས་ཀྱང་མངོན་པར་ཤེས་པ་རྣམས་དང་། ཏིང་ངེ་འཛིན་རྣམས་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་ཡོངས་སུ་རྫོགས་པར་བྱ་གཞན་ཡང་གཟུངས་ཀྱི་སྒོ་རྣམས་ལ་ཡང་དག་པར་བསྐུལ་བར་བར་བྱ།
en: They themselves should perfect the extrasensory powers, the meditative stabilities, and the dhāraṇī gateways, and they should also encourage others to acquire the dhāraṇī gateways [and so forth].

source: གཟུངས་ཀྱི་སྒོ་རྣམས་ཀྱི་ལེགས་པ་བརྗོད་པར་བྱ།
en: They should praise the dhāraṇī gateways [and so forth].

source: སེམས་ཅན་གཞན་གང་གཟུངས་ཀྱི་སྒོ་རྣམས་ཡོངས་སུ་རྫོགས་པར་བྱེད་པ་དེ་དག་གི་ལེགས་པ་བརྗོད་ཅིང་འཐུན་པས་དགའ་བར་བྱའོ།
en: They should praise and take empathetic delight in other beings perfecting the dhāraṇī gateways [and so forth].

source: །བདག་གིས་ཀྱང་དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་ཡོངས་སུ་རྫོགས་པར་བྱ།
en: They themselves should perfect the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, great loving kindness, and great compassion, and they should also encourage others to acquire great loving kindness, great compassion [and so forth].

source: གཞན་ཡང་བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་ལ་ཡང་དག་པར་བསྐུལ་བར་བར་བྱ།
en: They should praise great loving kindness, great compassion [and so forth].

source: བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོའི་ལེགས་པ་བརྗོད་པར་བྱ། སེམས་ཅན་གཞན་གང་བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་ཡོངས་སུ་རྫོགས་པར་བྱེད་པ་དེ་དག་གི་ལེགས་པ་བརྗོད་ཅིང་འཐུན་པས་དགའ་བར་བྱའོ།
en: They should praise and take empathetic delight in other beings perfecting great loving kindness, great compassion [and so forth].

source: །བདག་གིས་ཀྱང་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ཡོངས་སུ་རྫོགས་པར་བྱ། གཞན་ཡང་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་ལ་ཡང་དག་པར་བསྐུལ་བར་བར་བྱ།
en: They themselves should perfect the eighteen distinct qualities of the buddhas, and they should also encourage others to acquire the distinct qualities of the buddhas.

source: སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་ཀྱི་ལེགས་པ་བརྗོད་པར་བྱ།
en: They should praise the distinct qualities of the buddhas.

source: སེམས་ཅན་གཞན་གང་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་ཡོངས་སུ་རྫོགས་པར་བྱེད་པ་དེ་དག་གི་ལེགས་པ་བརྗོད་ཅིང་འཐུན་པས་དགའ་བར་བྱའོ།
en: They should praise and take empathetic delight in other beings perfecting the distinct qualities of the buddhas. {Ki.

source: །བདག་གིས་ཀྱང་རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་ལུགས་དང་ལུགས་མ་ཡིན་པ་ལ་མཉམ་པར་གཞག་པར་བྱ། གཞན་ཡང་རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་ལུགས་དང་ལུགས་མ་ཡིན་པའི་སྙོམས་པར་འཇུག་པ་ལ་ཡང་དག་པར་བསྐུལ་བར་བྱ།
en: IV: 139} “They themselves should be absorbed in the links of dependent origination in their forward and reversed operation, and they should also encourage others to be absorbed in the links of dependent origination in their forward and reversed operation.

source: རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་ལ་སྙོམས་པར་འཇུག་པའི་ལེགས་པ་བརྗོད་པར་བྱ།
en: They should praise absorption in the links of dependent origination.

source: སེམས་ཅན་གཞན་གང་རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་ལ་སྙོམས་པར་འཇུག་པ་དེ་དག་གི་ལེགས་པ་བརྗོད་ཅིང་འཐུན་པས་དགའ་བར་བྱ་སྟེ།
en: They should praise and take empathetic delight in other beings being absorbed in the links of dependent origination.
